---
layout: post
status: publish
published: true
title: 'Formal Languages, part 2: Regular Expressions and Regular Languages'
author:
  display_name: Peter
  login: admin
  email: aarestad@gmail.com
  url: http://www.peter-aarestad.com/blog/
author_login: admin
author_email: aarestad@gmail.com
author_url: http://www.peter-aarestad.com/blog/
wordpress_id: 146
wordpress_url: http://www.peter-aarestad.com/blog/?p=146
date: '2015-02-25 21:34:46 -0600'
date_gmt: '2015-02-26 02:34:46 -0600'
categories:
- Uncategorized
tags: []
comments: []
---
<p>Before I start in on this entry, I need to give credit where credit is due and note that my main reference source for these blog posts on formal languages is my grad school textbook,<a href="http:&#47;&#47;www.amazon.com&#47;Introduction-Formal-Languages-Automata-5th&#47;dp&#47;144961552X">&Acirc;&nbsp;<em>An Introduction to Formal Languages and Automata, Third Edition<&#47;em><&#47;a> by Peter Linz (the 5th edition is linked). If you're out there, Peter, thanks for writing an awesome intro to this nerdy topic, and congratulations on having a great first name. :)</p>
<p>So let's talk about regular expressions. Again, we're not talking about the <a href="http:&#47;&#47;perldoc.perl.org&#47;perlre.html">Perl <&#47;a>version with lazy matching and look-ahead and look-behind and all that magic; we're discussing&Acirc;&nbsp;austere, formalized regular expressions. The idea is that a regular expression matches a set of strings, and those strings make up a&Acirc;&nbsp;<strong>regular language<&#47;strong>. (This is jumping the gun a bit because we actually define regular languages using <strong>finite automata<&#47;strong>, but we'll come back to that later.)&Acirc;&nbsp;For formality's sake, we first note that the empty set &acirc;&circ;&hellip; and the empty string &Icirc;&raquo; themselves are regular expressions; the former is, of course, a set of zero sentences, while the latter is a set of one sentence, namely the empty string. In addition, any member&Acirc;&nbsp;<em>a<&#47;em> in a given alphabet &Icirc;&pound; is also a regular expression of a single sentence one symbol long. We then add on concatenation (<em>r<sub>1<&#47;sub><&#47;em>&Acirc;&middot;<em>r<sub>2<&#47;sub><&#47;em>, or more simply, <em>r<sub>1<&#47;sub>r<sub>2<&#47;sub><&#47;em>), alternation (<em>r<sub>1<&#47;sub><&#47;em> + <em>r<sub>2<&#47;sub><&#47;em>, which is expressed in Unix and Perl REs as <em>r<sub>1<&#47;sub><&#47;em> | <em>r<sub>2<&#47;sub><&#47;em>, and means "<em>r<sub>1<&#47;sub><&#47;em> or <em>r<sub>2<&#47;sub><&#47;em>") and star-closure (<em>r*<&#47;em>, i.e. zero or more&Acirc;&nbsp;<em>r<&#47;em>s in a row), where the&Acirc;&nbsp;<em>r<&#47;em>s are composed of the&Acirc;&nbsp;<em>primitive<&#47;em> regular expressions&Acirc;&nbsp;&acirc;&circ;&hellip;,&Acirc;&nbsp;&Icirc;&raquo;, and all&Acirc;&nbsp;<em>a<&#47;em>&Acirc;&nbsp;&acirc;&circ;&circ; &Icirc;&pound;. (We almost always ignore the &acirc;&circ;&hellip; and &Icirc;&raquo;, however, and just talk about combinations of symbols in the alphabet &Icirc;&pound;.) We can also group sub-expressions with parentheses. So this way, we can say things like "a language with an even number of&Acirc;&nbsp;<em>a<&#47;em>s followed by an odd number of&Acirc;&nbsp;<em>b<&#47;em>s", which would be expressed as:</p>
<p><em>r<&#47;em> = (<i>aa<&#47;i>)*(<i>bb<&#47;i>)*<i>b<&#47;i></p>
<p>To break that down, we first see that&Acirc;&nbsp;(<em>aa<&#47;em>)* represents any number of <i>aa<&#47;i>s: 0, 1, 2, etc., and so gives us an even number of <i>a<&#47;i>s. The second part, (<i>bb<&#47;i>)*<i>b<&#47;i>, indicates that we again have an even number of <i>b<&#47;i>s, but then there is one extra <i>b<&#47;i> at the end, giving us an odd number. We can give many examples of regular expressions: "all bit strings&Acirc;&nbsp;(i.e. strings of 0s and 1s) which has at least one pair of consecutive 0s", "all strings on an alphabet such that the length is divisible by 3", "all bit strings that, when interpreted as a binary number, is greater than or equal to 39", and so on. So it seems like we can define quite a few complicated languages using just this simple way of expressing patterns! However, remember the example from part 1:</p>
<p>[code]&#47;^1?$|^(11+?)\1+$&#47;[&#47;code]</p>
<p>This isn't a true regular expression, as we noted - you can't do things in regular expressions like "lazy matching" or "back-referencing". All we can say is "this followed by that", "this or that" and "zero or more thises". But maybe it's possible that there&Acirc;&nbsp;<em>is<&#47;em> a regular expression that does what the above does, namely match all composite numbers expressed in unary notation. Try if you'd like, but you'll soon see it's futile. In another post, I'll explain the goofily-named&Acirc;&nbsp;<strong>pumping lemma<&#47;strong> which is used to prove that a particular grammar does not represent a regular language, and thus cannot be represented by a regular expression. We'll then use the pumping lemma to prove that we can't construct a regular expression for this language.</p>
<p>I think that's enough for now. Next time, we'll discuss finite automata and how they're used to truly define regular languages. As a preview, we'll see that there are two types:&Acirc;&nbsp;<em>deterministic<&#47;em> automata which require that you always know what to do next, and&Acirc;&nbsp;<i>non-deterministic<&#47;i> automata which allows "guesses" as to how to proceed. The magic part, as we'll see, is that they are equivalent! But you'll have to come back later to see what I'm talking about. :)</p>
